Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་བཀོད་ནས་ཁ་ཤར་དུ་ཕྱོགས་ནས་པདྨའི་ཕྲེང་བ་ལ་ཉེ་བར་དགོད་པར་བྱའོ།
en: Next to the row of lotuses, he should place an image of Noble Avalokiteśvara facing east.

source: །དེ་ནས་རིག་སྔགས་འཆང་གིས་བདུག་པའི་རྒྱལ་པོ་ལ་ཡོངས་སུ་བཟླས་པར་བྱ་སྟེ། ཉི་མ་བདུན་ལ་ཐུན་གསུམ་དུ་དོན་ཡོད་པའི་རྒྱལ་པོ་བརྒྱ་རྩ་བརྒྱད་བཟླས་ཤིང་སྙིང་པོ་བརྒྱ་རྩ་བརྒྱད་བཟླས་སོ།
en: He should then incant the king of incense one hundred and eight times each with the Amogharāja and the heart mantras for seven days at the three junctions of the day.

source: །དོན་ཡོད་པའི་སྙིང་པོ་ཡི་གེ་གཅིག་པའི་བཟླས་བརྗོད་འབུམ་རྫོགས་པ་སྟེ།
en: He should then recite the one-syllable mantra of the amogha heart-essence a full one hundred thousand times.

source: སྟོང་ཕྲག་བརྒྱ་རྫོགས་པ་ནི་བཟླས་བརྗོད་ཀྱི་ཆོ་གའོ།
en: This will complete the recitation procedure. “

source: །དེ་ནས་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལ་མཆོད་པ་བྱ་ཞིང་། སླར་ཡང་དོན་ཡོད་པའི་རྒྱལ་པོའི་བཟླས་བརྗོད་ཉི་ཤུ་རྩ་གཅིག་དང་། ཁྲོ་བོའི་རྒྱལ་པོའི་བཟླས་བརྗོད་ཉི་ཤུ་རྩ་གཅིག་བྱའོ།
en: Next, the vidyā holder should make offerings to Noble Avalokiteśvara and recite the Amogharāja an additional twenty-one times, followed by the Krodharāja twenty-one times.

source: །དེ་ནས་ཐོག་མར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་བདུག་པ་དབུལ་བར་བྱ། དེ་ནས་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལ་བདུག་པ་དབུལ་ལོ།
en: He should then offer the incense, first to the blessed Buddha and then to the image of Noble Avalokiteśvara.

source: །འདི་ནི་བདུག་པ་སྒྲུབ་པའི་ཆོ་ག་གྲུབ་པར་འགྱུར་རོ།
en: This constitutes the practice procedure of the incense.

source: །བདུག་པའི་རྒྱལ་པོ་འདིས་བྱ་བ་དེ་སྒྲུབ་པར་འགྱུར་རོ།
en: When this procedure is successfully performed, the king of incense will accomplish the given task. “

source: །གལ་ཏེ་རིག་སྔགས་འཆང་གིས་ཡུངས་ཀར་གྱི་འབྲས་བུ་གཅིག་གི་ཚད་ཙམ་གྱི་བདུག་པས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་མཆོད་པར་འདོད་པ་དང་། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་དྲི་གཅིག་གིས་རྒྱས་པར་འདོད་པ་དང་། བདུག་པའི་སྤྲིན་འཁྲིགས་པས་ཀུན་ནས་གཡོགས་པར་འདོད་པ་དང་། དྲི་སྣ་ཚོགས་པའི་ཆར་འབེབས་པར་བྱེད་པར་འདོད་པ་དེས། བདུག་པའི་རྒྱལ་པོས་བདུག་པ་དེ། རིག་སྔགས་འཆང་གིས་རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་མངོན་པར་བརྩོན་པར་བྱའོ།
en: If the vidyā holder wants to worship all the tathāgatas, if he wants to fill the world spheres of the entire great trichiliocosm with the scent of the incense, if he wants to cover the entire area with masses of clouds of the incense smoke, or if he wants to send a rain of various scents, he should apply himself to the task of continually burning this king of incense, even if it is just an amount as small as one mustard seed.

source: །དེ་ནས་རིག་སྔགས་འཆང་གིས་ཉི་མ་རེ་རེ་ཞིང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དང་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་སྤྱན་སྔར་དཀྱིལ་འཁོར་བྱས་ལ་མེ་ཏོག་གཅལ་དུ་བཀྲམ་པར་བྱའོ། མཆོད་ཡོན་དང་།
en: Every single day he should prepare a small maṇḍala in front of the blessed Buddha and Noble Avalokiteśvara and strew it with flowers.

source: ཞབས་བསིལ་ཡང་གཞག་པར་བྱ། བདུག་པའི་རྒྱལ་པོ་འདིས་བདུག་པར་བྱ་ཞིང་།
en: He should put out argha water for the feet and burn the king of incense.

source: དོན་ཡོད་པའི་རྒྱལ་པོ་དུས་གཅིག་ཏུ་བརྗོད་པར་བྱ་སྟེ། ཕྱོགས་བཅུར་བདུག་པའི་པོག་ཕོར་དབུལ་བར་བྱའོ། །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཡིད་ལ་བྱེད་པར་འགྱུར་བ་དང་།
en: Pronouncing the Amogharāja just once, he should offer the incense while pointing the incense holder in each of the ten directions and bringing all the tathāgatas to mind.

source: སེམས་ཅན་འབྱུང་པོ་ཐམས་ཅད་ལ་བྱམས་པ་བསྒོམ་པར་བྱ། སངས་རྒྱས་ཀྱི་ཞིང་དུ་གཏོགས་པ་ཐམས་ཅད་དྲི་མ་མེད་པའི་སེམས་ཀྱིས་ཡིད་ལ་བསྒོམ་པར་བྱ།
en: He should generate love for all beings and direct his pure thoughts to all those who inhabit buddha fields.

source: དཀྱིལ་འཁོར་ལ་མེ་ཏོག་དང་བདུག་པ་དང་།
en: He should offer flowers, incense, and argha water for the feet.

source: མཆོད་ཡོན་དང་། ཞབས་བསིལ་ཕུལ་ཏེ་ཡི་གེ་གཅིག་པ་ཡིད་ལ་བརྗོད་ཅིང་། ཕྱག་རྒྱ་ཡང་ལན་ཅིག་བཅིངས་ལ་ཕྱག་བྱའོ་ཞེས་སོ།
en: He should mentally recite the one-syllable mantra just once while displaying the mudrā, and then bow in homage. “

source: །ཕུལ་བ་ཙམ་གྱི་མོད་ལ་ཕྱོགས་རེ་རེ་ཞིང་གང་གཱའི་ཀླུང་གི་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དགུ་བཅུ་རྩ་དགུའི་སངས་རྒྱས་བྱེ་བ་ལ་དྲིས་ཁྱབ་པར་བྱེད་ཅིང་། བདུག་པ་ཆེན་པོ་འཁྲིགས་པས་ནམ་མཁའི་མཐིལ་དུ་ཁྱབ་པར་འགྱུར་རོ།
en: As soon as the offering is made, the scent will rouse hundreds of thousands of millions of billions of buddhas, as numerous as the grains of sand in ninety-nine Gaṅgā rivers, who will come forth from each of the ten directions and will remain in the sky, floating on the great clouds of incense smoke.

source: །དྲི་སྣ་ཚོགས་ཀྱི་ཆར་འབབ་པར་འགྱུར་ཏེ། བཅོམ་ལྡན་འདས་མཆོད་པའི་ལས་སངས་རྒྱས་ཀྱི་ཞིང་རེ་རེ་ཞིང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བྱེ་བ་དགུ་བཅུ་རྩ་དགུའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པར་འགྱུར་རོ།
en: A rain of various scents will fall as an offering to the Blessed One, and hundreds of thousands of millions of billions of blessed buddhas in each and every buddha field, as numerous as the grains of sand in ninety-nine Gaṅgā rivers, will be worshiped simultaneously. “

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་མཆོད་པས་དེ་བཞིན་གཤེགས་པ་དེ་རྣམས་ཐམས་ཅད་རིག་སྔགས་འཆང་ལ་དུས་དུས་སུ་དོན་ཡོད་པའི་རྒྱལ་པོ་དྲན་པར་བྱེད་པ་སྲུང་བའི་དོན་དང་། ཕྱག་རྒྱ་འཆིང་བར་བྱེད་པ་དེ་སྲུང་བའི་དོན་དུ།
en: Because of this act of worship, all these tathāgatas will mindfully repeat the Amogharāja and display the mudrā of protection for the sake of the vidyā holder, in order to protect him.

source: ལེགས་སོ་ཞེས་བྱ་བའི་སྒྲ་རྗོད་པར་བྱེད་དོ། །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་བྱམས་པ་རྒྱས་པར་བྱེད་པ་དེ་བཞིན་དུ་བྱའོ།
en: They will utter words of applause, and in doing so they will sparkle with loving kindness.

source: །དོན་ཡོད་པ་ཆེན་པོའི་དངོས་གྲུབ་ཀྱང་སྦྱིན་པར་བྱེད་དོ།
en: They will grant the vidyā holder a great amogha accomplishment.

source: །དེ་བཞིན་གཤེགས་པ་དེ་རྣམས་ཀྱི་དྲུང་དུ་བསོད་ནམས་ཀྱི་ཚོགས་ཆེན་པོ་ཉེ་བར་སོག་པ་བྱེད་དོ། དེ་བཞིན་གཤེགས་པ་རེ་རེ་ཞིང་། བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་གི་དྲུང་དུ་བསོད་ནམས་ཀྱི་ཕུང་པོ་དང་། དགེ་བའི་རྩ་བ་ཉེ་བར་སོགས་པར་བྱེད་དོ།
en: In the presence of each and every one of them, he will accumulate a great amount of merit and plant hundreds of thousands of millions of roots of virtue that will produce heaps of merit. “

source: །ཇི་ལྟར་རིག་སྔགས་འཆང་དེ་བཞིན་གཤེགས་པ་མཆོད་པའི་ཆོ་ག་བྱེད་བྱེད་པར་དེ་བཞིན་དུ། རྣམ་པ་དུ་མ་དེ་བཞིན་གཤེགས་པ་རེ་རེ་ཞིང་གི་སྤྱན་སྔར་རབ་ཏུ་འབྱུང་བར་འགྱུར་རོ།
en: As the vidyā holder offers various specified articles to the Tathāgata, all these various offerings will appear before each and every tathāgata.

source: །རིག་སྔགས་འཆང་ཉི་མ་བདུན་དུ་རབ་ཏུ་བརྩོན་པས། དེ་བཞིན་གཤེགས་པ་དང་། བླ་མ་མཆོད་དོ། །ཕྱོགས་བཅུའི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་མངོན་སུམ་དུ་མཐོང་བ་སྩོལ་བར་བྱེད་དོ།
en: If the vidyā holder performs this guru pūjā for the tathāgatas over a period of seven days, they will grant him a direct vision of themselves in any of the ten directions.

source: །དེ་རྣམས་ཐམས་ཅད་ཀྱི་དབུགས་འབྱིན་པར་བྱེད་ལ་མཆོག་རབ་ཏུ་སྩོལ་བར་འགྱུར་རོ། །དོན་ཡོད་པའི་དངོས་གྲུབ་རྗེས་སུ་སྩོལ་བར་འགྱུར་རོ།
en: They will all comfort and encourage him, grant him boons, and bestow amogha accomplishments upon him.

source: །ཕྱིར་མི་ལྡོག་པ་ལ་རབ་ཏུ་གནས་པར་འགྱུར་རོ།
en: The vidyā holder will become established on the level of a not turning back.

source: །ས་བཅུ་ཡང་དག་པར་གནོན་ཏེ་མངོན་པར་ཤེས་པ་ལྔར་འགྱུར་རོ།
en: He will attain the ten bodhisattva levels and the five superknowledges.

source: །འཇིག་རྟེན་པའི་བདུག་པ་སྒྲུབ་པའི་ཆོ་གའོ།
en: These are the worldly benefits of the practice procedure of the incense. “

source: །དེ་བཞིན་ཉིད་དུ་འཇིག་རྟེན་ལས་འདས་པ་ལ་འཆི་འཕོ་བ་ན་དེ་བཞིན་གཤེགས་པའི་སྤྱན་སྔའི་ཞབས་དྲུང་དུ་པདྨ་ལས་རྫུས་ཏེ་སྐྱེ་བར་འགྱུར་རོ། །ཚེ་རབས་དྲན་པར་ཡང་འགྱུར་རོ།
en: When it is time for the vidyā holder to leave his current birth and move on to the next, he will be spontaneously born from a lotus flower in the presence of the tathāgatas, at the feet of a tathāgata, and will be able to remember his successive births.

source: །དེ་བཞིན་གཤེགས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་གང་དང་གང་དུ་འགྲོ་བར་བྱེད་པ་དེ་ཐམས་ཅད་དུ་ཡང་། དེ་བཞིན་གཤེགས་པས་རིག་སྔགས་འཆང་ལ་ལུང་སྟོན་པར་འགྱུར་རོ། །ཕྱིས་ཀྱང་སྐྱེ་བ་གཞན་དུ་སྐྱེ་བར་མི་འགྱུར་རོ།
en: All the tathāgatas in the buddha field in which he arrives will prophesy his becoming a tathāgata, and he will not be reborn in any other place.

source: །ལུས་འདི་ཉིད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་བསྙེན་བཀུར་ནས། བདེ་བ་ཅན་གྱི་འཇིག་རྟེན་གྱི་ཁམས་སུ་སོང་སྟེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བར་བྱེད་དོ། །ཚེ་དཔག་ཏུ་མེད་པར་འགྱུར་རོ།
en: Having attended upon every tathāgata, he will, in the same body, ascend to the realm of Sukhāvatī, where he will become a blessed buddha who turns the wheel of Dharma.

source: །དེ་བཞིན་གཤེགས་པ་ཚེ་དཔག་ཏུ་མེད་པ་ཇི་ལྟ་བ་དེ་བཞིན་དུ། འདིའི་རྫུ་འཕྲུལ་དང་རྣམ་པར་འཕྲུལ་པའི་ཁྱད་པར་སོ་སོར་ཐོབ་བོ།
en: His lifespan will be infinite, and just like a tathāgata with an infinite lifespan, he will obtain the special powers to work miracles and perform magical transformations.

source: །འདི་ནི་འཇིག་རྟེན་ལས་འདས་པའི་བདུག་པ་སྒྲུབ་པའི་ཁྱད་པར་འགྱུར་རོ།
en: This practice of the incense is thus particularly beneficial for the afterlife. “

source: །དེ་ནས་འཇིག་རྟེན་པའི་བདུག་པ་སྒྲུབ་པའི་ཆོ་ག་བརྒྱ་སྟོང་ཕྲག་དུ་མ་འགྲུབ་པར་བྱེད་དོ།
en: This practice procedure for the incense will similarly accomplish hundreds of thousands of worldly aims.

source: །ཇི་ལྟ་ཇི་ལྟར་བདུག་པ་ཉིད་ཡིད་ལ་བྱེད་པ་དེ་ལྟ་དེ་ལྟར་ཐམས་ཅད་ཡང་དག་པར་འགྲུབ་པར་འགྱུར་རོ།
en: The vidyā holder will fully accomplish whatever he has in mind while burning the incense.

source: །ཀླུའི་གནས་སུ་བདུགས་ན། བདུགས་པ་ཙམ་གྱི་མོད་ལ། ཀླུའི་རྒྱལ་པོས་ཆར་རྒྱུན་ཆེན་པོ་འབྱིན་པར་བྱེད་དོ།
en: If he burns the incense close to a dwelling of nāgas, the nāga kings will send torrents of rain.

source: །རྒྱལ་པོའི་སྒོ་རུ་བདུགས་ན། རྒྱལ་པོ་དང་། བཙུན་མོའི་འཁོར་གཡོག་དང་བཅས་པ་དབང་དུ་གྱུར་ནས་གནས་སོ།
en: If he burns the incense at the entrance to the royal household, the king, together with his harem and retinue, will fall under and remain in the vidyā holder’s thrall.

source: །སྐྱེ་བོ་མང་པོའི་དབུས་སུ་བདུགས་ན། རིགས་བཞིའི་འཇིག་རྟེན་དབང་དུ་གྱུར་ནས་གནས་སོ།
en: If he burns the incense in the midst of a great crowd, the people of all four castes will fall under and remain in his thrall.

source: །བདག་ཉིད་ལ་བདུགས་ན། ཐམས་ཅད་དུ་མཆོད་པའི་འོས་ཆེན་པོར་འགྱུར་རོ།
en: If he fumigates his body with the incense, he will become an object of great veneration.

source: །ནད་ཐམས་ཅད་ལ་བདུགས་ན། ནད་ཐམས་ཅད་ཡོངས་སུ་གྲོལ་བར་བྱེད་དོ།
en: If he burns the incense to target any disease, he will be freed from that disease.

source: །དུག་ལ་བདུགས་ན་དུག་མེད་པར་འགྱུར་རོ།
en: If he burns the incense to target poison, the poison will be neutralized.

source: །མཚམས་ཀྱི་ནང་དུ་བདུགས་ན་མེ་ཏོག་དང་། འབྲས་བུ་ཐམས་ཅད་རོ་ཞིམ་པ་དང་། ལེགས་པར་བསྲུངས་པར་འགྱུར་རོ།
en: If he burns the incense within the borders of a certain area, all the flowers in that area will be well protected and the fruits will taste good.

source: །ལོ་ཐོག་ལ་བདུགས་ན། འབྲུའི་ཕུང་པོ་ཆེན་པོར་འགྱུར་རོ། །ཁྱིམ་མམ། གཙུག་ལག་ཁང་ངམ།
en: If he fumigates crops, he will reap an abundant harvest.

source: གྲོང་ངམ། གྲོང་ཁྱེར་ལ་བདུགས་ན། དུག་དང་། སྦྱར་དུག་དང་། དུག་དང་བཅས་པའི་སྲོག་ཆགས་ཐམས་ཅད་ནམ་ཡང་མི་འབྱུང་ངོ་།
en: If the vidyā holder burns the incense at home, in a monastery, in a village, or in a town, it will be free of poisons, and no living creatures will ever be affected by venom or poison.

source: །གཡུལ་གྱི་དབུས་སུ་བདུགས་ན་ཆེར་རྒྱལ་བར་འགྱུར་རོ། །བདག་ཉིད་དམ། གཞན་རྣམས་སམ། དོན་མཐུན་པ་རྣམས་ལ་བདུགས་ན།
en: If he burns the incense in the middle of a battle, he will obtain a resounding victory.

source: ལམ་དུ་འགྲོ་བ་ན་ཆོམ་རྐུན་དང་། གཡོན་ཅན་དང་། རྐུན་མོ་དང་། གཅན་གཟན་གཏུམ་པོའི་འཇིགས་པ་ཐམས་ཅད་མི་སྣང་བར་འགྱུར་ཞིང་། བདེ་བ་དང་ལེགས་པས་རང་གི་ཁྱིམ་དུ་འོང་ངོ་།
en: If he censes himself and his fellow travelers before traveling on the road, they will become invisible to any danger, including thieves, rogues, bandits, and wild animals, and will return home in safety and comfort.

source: །དཔག་ཚད་སྟོང་དུ་འགྲོ་ཡང་ངལ་བ་མེད་ཅིང་། སླར་ཡང་འོང་བར་བྱེད་དོ།
en: The vidyā holder will be able to travel one thousand leagues and back without getting tired. “

source: །དུང་ལ་བདུགས་ནས་མཐོན་པོར་བུས་ན་ཇི་སྲིད་དུང་གི་སྒྲ་ཐོས་པ་དེ་སྲིད་དུ་གནོད་པ་ཐམས་ཅད་དང་། འཇིགས་པ་ཐམས་ཅད་དང་། ནད་ཐམས་ཅད་དང་། མཚོན་ཆ་དང་། འཐབ་མོ་དང་། འཐབ་པ་དང་། རྩོད་པ་དང་།
en: If the vidyā holder burns the incense at an elevated place and blows a conch, all beings who hear the sound, however many there are, will be freed from all disease, fear, ailments, fighting, quarrels, disputes, and disagreements.

source: འགྱེད་པ་དང་། ཕྱིར་རྒོལ་བ་དང་། དགྲ་བོ་དང་། སྡང་བ་དང་། རབ་ཏུ་སྡང་བའི་སེམས་ཅན་ཐམས་ཅད་རྣམ་པར་ཉམས་པར་བྱེད་དོ།
en: All their adversaries and opponents with wicked and nasty intentions will disappear.

source: །ཡམས་ཐམས་ཅད་དང་། ཉེ་བར་འཚེ་བ་དང་། ནད་འགོ་བ་ཐམས་ཅད་དང་། འཁྲུགས་པ་ཐམས་ཅད་རྣམ་པར་ཉམས་པར་བྱེད་དོ།
en: All the calamities, misfortunes, and accidents, and all their struggles, will disappear.

source: །བདེ་བ་དང་། ལོ་ལེགས་པ་དང་། དགའ་བར་འོས་པར་འགྱུར་རོ།
en: Instead, they will enjoy comfort and prosperity.

source: །དགེ་བའི་རྩ་བ་ཐམས་ཅད་འདོད་པར་འགྱུར་རོ། །ནད་མེད་པ་དང་། གནོད་པ་མེད་པ་དང་། རིམས་མེད་པ་དང་། ཐང་ཆད་པ་མེད་པར་ཇི་སྲིད་འཚོའི་བར་དུ་གནས་སོ།
en: They will desire everything that is virtuous and will be free from all ailments, disease, fever, and fatigue for as long as they live. “

source: །ཁང་པའི་སྟེང་མཐོན་པོར་ཕྱོགས་བཞིར་བདུགས་ན། རླུང་དང་། སད་དང་སྤྲིན་གྱི་སེར་བ་ཐམས་ཅད་བཅིང་བར་འགྱུར་ཏེ། ཇི་སྲིད་ཡིད་ལ་བྱེད་པ་ནར་མར་ཡོད་པ་དེ་སྲིད་དུ་མཚམས་བཅིང་བར་བྱས་པར་འགྱུར་རོ། །ཁྱིམ་གྱི་ནང་དུ་བདུགས་ན། བུད་མེད་དང་། སྐྱེས་པ་དང་།
en: If the vidyā holder burns the incense in a sheltered place at an elevated spot, offering it into each of the four directions, all cold spells, strong winds, and hailstorms will be arrested.

source: ཁྱེའུ་དང་།
en: The vidyā holder will create a protective boundary for any area he focuses on.

source: བུ་མོ་དང་། བྲན་ཕོ་དང་། བྲན་མོ་ཐམས་ཅད་དང་། ཇི་སྲིད་དུ་རྐང་གཉིས་པ་དང་། རྐང་བཞི་པ་ཐམས་ཅད་བྱམས་པའི་ཡིད་དུ་འགྱུར་ཏེ་དབང་དུ་གྱུར་ནས་གནས་སོ།
en: If he burns the incense inside a house, all the women, men, boys, and girls, all the male and female servants, and all the bipeds and quadrupeds who live there will give rise to thoughts of loving kindness.

source: །ཇི་སྲིད་འཚོའི་བར་དུ་བསྙེན་བཀུར་བྱེད་དོ།
en: They will remain in the vidyā holder’s thrall and serve him for as long as he lives.

source: །སླར་ཡང་ཡིད་གཞན་དུ་མི་འགྱུར་རོ།
en: They will never stray from the thoughts of loving kindness. “

source: །འཆི་བའི་དུས་ཀྱི་ཚེ། བདུགས་ན། དྲི་མནམས་པའི་མཐུ་དེས། སངས་རྒྱས་རྗེས་སུ་དྲན་པ་སྐྱེས་ཏེ། དེ་བཞིན་གཤེགས་པ་བྱེ་བ་ཕྲག་དགུ་བཅུ་རྩ་དགུ་མངོན་སུམ་དུ་མཐོང་བ་སོ་སོར་ཐོབ་སྟེ།
en: If the incense is burned at the time of death, the dying person will be reminded of the Buddha when he smells the scent, and he will obtain a direct vision of ninety-nine million tathāgatas, as numerous as the grains of sand in ninety-nine Gaṅgā rivers.

source: ཕྱིར་ཀྱང་ངན་འགྲོ་ལོག་པར་ལྟུང་བར་འགྲོ་བར་མི་འགྱུར་རོ། །དགེ་བའི་རྩ་བའི་ཚོགས་ཐམས་ཅད་ཡང་དག་པར་འཛིན་པར་འགྱུར་རོ། །འཆི་འཕོ་བ་ན་བདེ་བ་ཅན་གྱི་འཇིག་རྟེན་གྱི་ཁམས་སམ།
en: They will never again proceed downward into unhappy destinies; provided with the root of every virtue, they will go to the realm of Sukhāvatī or Abhirati when they leave this world.

source: མངོན་པར་དགའ་བར་སྐྱེས་ཏེ་འདི་ལ་དོགས་པ་དང་། ཡིད་གཉིས་བསྐྱེད་པར་མི་བྱ་ཞིང་། ཐེ་ཚོམ་བསྐྱེད་པར་མི་བྱའོ། །ཞེས་སོ།
en: One should not feel uncertain about, question, or entertain doubts about this. “

source: །མ་མོའི་དཀྱིལ་འཁོར་གྱི་ཁྱིམ་ལ་བདུགས་ན། ནག་པོ་ཆེན་པོ་ལ་སོགས་པ། མ་མོའི་ཚོགས་ཀྱིས་ཡོངས་སུ་བསྐོར་བ། དབང་དུ་གྱུར་པར་འགྱུར་ཏེ། མདུན་དུ་ཉེ་བར་གནས་པར་བྱེད་དོ།
en: If the vidyā holder burns the incense in a shrine dedicated to the group of mātṛs headed by Mahākāla, Mahākāla will, together with his retinue of mātṛs, fall under the vidyā holder’s thrall and arrive in front of him.

source: ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོ་ཐམས་ཅད་དང་། ནག་པོ་ཆེན་པོའི་གཟུགས་བརྙན་གྱི་སྤྱི་བོའི་གཙུག་ཏུ་འདུག་ན།
en: If he burns the incense above the head of the Mahākāla image, all devas, nāgas, yakṣas, and rākṣasas will vomit blood as soon as the incense is burned.

source: བདུགས་པ་ཙམ་གྱི་མོད་ལ།
en: If the vidyā holder catches some of it and makes a bindi on his forehead, he will float in midair.

source: ཁ་ནས་ཁྲག་སྐྱུག་གོ། །རིག་སྔགས་འཆང་གིས་དེ་བླངས་ཏེ། ཐིག་ལེ་བྱས་ནས་ནམ་མཁའ་ལ་ལྡིང་བར་བྱེད་དོ། །མིག་ལ་བྱུགས་ན་མི་སྣང་བར་འགྱུར་ཏེ། བདེ་བླག་ཏུ་འབྱུང་པོའི་བདག་པོ་ཆེན་པོར་འགྱུར་རོ།
en: If he anoints his eyes with the blood, he will become invisible and will promptly become the lord of powerful bhūtas.

source: །ལྟོ་བར་ཡོངས་སུ་བྱུགས་ན། གནོད་སྦྱིན་དང་སྲིན་པོའི་དཔོན་པོའོ།
en: If he rubs the blood onto his navel, he will become a lord of yakṣas and rākṣasas.

source: །ལུས་མཐའ་དག་ལ་བྱུགས་ན། སྟོབས་དང་། བརྩོན་འགྲུས་དང་། རྩལ་ཆེན་པོ་ནག་པོ་ཆེན་པོ་དང་མཚུངས་པའི་ཤུགས་སུ་འགྱུར་ཏེ།
en: If he smears the blood on his entire body, he will obtain great strength, energy, and valor.

source: དེ་ཉིད་ཀྱི་གཟུགས་སུ་འགྱུར་རོ། །འཁོར་གྱི་ཚོགས་ཆེན་པོར་ཡང་འགྱུར་རོ།
en: His intense energy will match that of Mahākāla himself, and he will assume Mahākāla’s form and acquire a large retinue. “

source: །ཚངས་པ་ལ་བདུགས་ན། བདུགས་པ་ཙམ་གྱི་མོད་ལ།
en: If he censes an image of Brahmā, milk will immediately flow.

source: འོ་མ་འཛག་པ་བླང་བར་བྱ་སྟེ། ལུས་ལ་བྱུག་པར་བྱའོ། །ཚངས་པ་དང་འདྲ་བའི་སྟོབས་དང་ཞུགས་སུ་འགྱུར་ཏེ་ནམ་མཁའ་ལ་འགྲོ་བར་བྱེད་དོ། །ཁྱབ་འཇུག་ལ་བདུགས་ན།
en: If he catches some of it and smears it onto his body, he will become as strong and powerful as Brahmā and will be able to travel through space. “

source: བདུགས་པ་ཙམ་གྱི་མོད་ལ་ལུས་ལ་པ་ལཱ་ཤའི་ཁ་དོག་གི་དྲིའི་ཆུ་འཛག་སྟེ།
en: If he censes an image of Viṣṇu, perfumed water the color of the flame-of-the-forest blossoms will immediately flow from Viṣṇu’s body.

source: རིག་སྔགས་འཆང་གི་ལུས་ལ་བྱུག་པར་བྱའོ། །སྲེད་མེད་ཀྱི་བུའི་གཟུགས་དང་། སྟོབས་དང་། ཤུགས་འཆང་བར་འགྱུར་ཏེ།
en: If he smears some onto his body, he will obtain the form, strength, and swiftness of Nārāyaṇa.

source: ལག་ན་འཁོར་ལོ་ཐོགས་པས་ནམ་མཁའ་ལ་འགྲོའོ།
en: With a discus in his hand, he will rise into the air. “

source: །དབང་ཕྱུག་ཆེན་པོ་ལ་བདུགས་ན། དབང་ཕྱུག་ཆེན་པོའི་ལུས་ལ་རྡུལ་འབྱུང་སྟེ།
en: If he censes the figure of Maheśvara, Maheśvara’s body will produce sweat.

source: རིག་སྔགས་འཆང་གི་ལུས་ལ་བྱུག་པར་བྱའོ། །དབང་ཕྱུག་ཆེན་པོའི་གཟུགས་སུ་འགྱུར་ཏེ། ལག་ན་མདུང་རྩེ་གསུམ་དང་། སྟོབས་དང་། བརྩོན་འགྲུས་དང་།
en: If he smears some onto his body, he will obtain the form of Maheśvara and become a powerful lord of bhūtas with a trident in his hand, and he will be full of energy, strength, and valor.

source: རྩལ་གྱིས་འབྱུང་པོའི་བདག་པོ་ཆེན་པོར་འགྱུར་ཏེ་ནམ་མཁའ་ལ་འགྲོའོ།
en: He will be able to travel through space. “

source: །ཐམས་ཅད་ལ་དོན་ཡོད་རྒྱལ་པོའི་བཟླས་བརྗོད་ལན་གསུམ་གསུམ་རྣམ་པར་སྦྱིན་པར་བྱའོ། །སྙིང་པོ་ཡི་གེ་གཅིག་པས་སྤྱི་བོར་བཟླས་བརྗོད་ལན་བདུན་དུ་བཟླས་བརྗོད་སྦྱིན་པར་བྱའོ།
en: In each of these rites, the vidyā holder should recite the Amogharāja three times into the ear of the deity’s image, and the one-syllable heart mantra seven times at the deity’s head. “

source: །སྤྲ་ཚིལ་ལས་བྱུང་བའི་ཀླུ་མགོ་བོ་དགུ་པ་སོར་བཞི་པའི་ཚད་དུ་བྱ་སྟེ་གསེར་གྱིས་གཡོག་པར་བྱ་ཞིང་དྲིའི་དཀྱིལ་འཁོར་བྱ་སྟེ།
en: The vidyā holder should fashion out of beeswax a figure of the nāga Navaśīrṣaka four fingers tall and cover it in gold.

source: དཀྱིལ་འཁོར་གྱི་སྟེང་དུ་གཞག་པར་བྱའོ། །དོན་ཡོད་པའི་རྒྱལ་པོས་ལན་བརྒྱ་རྩ་བརྒྱད་དུ་བཟླས་སོ།
en: He should prepare a perfumed maṇḍala, place the figure there, incant it with the Amogharāja one hundred and eight times, and cense it with the same incense.

source: །བདུག་པ་འདིས་བདུགས་པས་ཀླུ་ལྡང་བར་བྱེད་དོ།
en: The nāga figure will then come alive.

source: །རིག་སྔགས་འཆང་གིས་འཇིགས་པ་མེད་པར་བྱ་སྟེ། ཁྲོ་བོའི་རྒྱལ་པོ་ཡུངས་ཀར་ལ་བཟླས་ཏེ། སྤྱི་བོའི་གཙུག་ཏུ་བརྡེགས་ན། ལྡིང་བར་བྱེད་དོ།
en: The vidyā holder must not be afraid but should incant mustard seeds with the Krodharāja mantra and throw them at the crown of the nāga’s head.

source: །གང་དུ་འདོད་པ་དེར་གནས་ནས།
en: Water will flow up, and the vidyā holder can use it however he wants.

source: ཀླུ་ཆེན་པོའི་མཚོ་དང་། གནས་དང་། གཞལ་མེད་ཁང་རབ་ཏུ་འབྱུང་ངོ་། །ཆུ་གང་ཡིན་པ་དེ་རྣམས་ཀྱང་འཐུང་བར་བྱེད་པ་དང་།
en: The great ocean and the palatial abodes of the nāgas will come into view.

source: ཁྲུས་བྱེད་པའི་བུད་མེད་དང་། སྐྱེས་པ་དང་། ཁྱེའུ་དང་། བུ་མོའམ། ཐ་ན་དུད་འགྲོའི་སྐྱེ་གནས་སུ་སོང་བས་འཐུང་བ་དང་ཁྲུས་བྱེད་པ་དེ་རྣམས་ཐམས་ཅད་ཀྱང་ནད་རྣམས་དང་བྲལ་བར་འགྱུར་རོ།
en: All those who drink this water or bathe in it—women, men, boys, girls, and so forth, including animals—will be cured of their diseases.

source: །སྡིག་པ་དང་། སྒྲིབ་པ་དང་བྲལ་བ་དང་། འཇིགས་པ་ཐམས་ཅད་དང་བྲལ་བར་ཡང་འགྱུར་རོ། །ཀླུ་རྣམས་ཀྱང་དུས་དུས་སུ་ཆར་གྱི་རྒྱུན་ཆེན་པོ་འབྱིན་པར་བྱེད་ཅིང་།
en: Their evil and obscurations will be eradicated, and they will be freed from all fear.

source: ཆར་འབེབས་པར་བྱེད་དོ། །དུས་དུས་སུ་མེ་ཏོག་དང་། འབྲས་བུ་དང་། ལོ་ཐོག་རྣམས་རྫོགས་པར་བྱེད་དེ། རོ་ཞིམ་པོའི་རོ་མྱོང་བར་འགྱུར་རོ།
en: The nāgas will send abundant rain at the right time, flowers, fruits, and crops will ripen at the right time, and they will be juicy, succulent, and tasty.

source: །ཕྱིར་ཞིང་ལོག་པར་ལྟུང་བར་འགྲོ་བར་མི་འགྱུར་རོ།
en: The vidyā holder will never again meet with any misfortune.

source: །ཕུག་དང་ཁུང་བུའི་སྒོ་རུ་འཁྲུལ་འཁོར་གྱི་སྒོ་གླེགས་ལ་བདུགས་ན་བྱེ་ཞིང་གཅོག་པར་འགྱུར་རོ།
en: The doors within secret openings and terrestrial passages will open to him, and their locks, panels, and posts will split apart. “

source: །འཁྲུག་པའི་དུས་སུ་བདུགས་ན་འཕམ་པར་འགྱུར་རོ།
en: If the vidyā holder burns the incense when going to battle, he will become invincible.

source: །ལག་མཐིལ་ལ་བདུགས་ན། གང་དང་གང་ལ་རེག་པ་ཐམས་ཅད་དུ་དབང་དུ་བྱེད་དོ།
en: If he fumigates the palm of his hand with the incense, he will enthrall any being he subsequently touches. “

source: །བདུག་པའི་དཀྱིལ་འཁོར་གྱི་ཆོ་གའོ།། །།
en: This concludes the instructions for the rites of the incense maṇḍala. “

source: དེ་ནས་སྨན་གྱི་དཀྱིལ་འཁོར་གྱི་ཆོ་ག་བཤད་པར་བྱ་སྟེ།
en: Now I will teach the procedure for the maṇḍala of an amogha medicinal remedy that is unmatched in every respect.

source: དོན་ཡོད་པར་ཐམས་ཅད་དུ་གཞན་གྱིས་མི་ཐུབ་པ་ནད་ཐམས་ཅད་སེལ་བར་གྲུབ་པ། ཐམས་ཅད་དུ་དུག་འཇོམས་པར་བྱེད་པ། ན་བ་ཐམས་ཅད་སེལ་བར་གྲུབ་པ། སྡང་བ་ཐམས་ཅད་ལྡོག་པར་བྱེད་པ།
en: It is ideal for curing all diseases, neutralizing all poisons, and removing all ailments.

source: འབྱུང་པོ་ཐམས་ཅད་ལ་མི་འཇིགས་པ། མཚོན་དང་། མེ་དང་། ཆུ་དང་། དུག་རབ་ཏུ་འཇོམས་པ།
en: It is very effective in suppressing all wicked beings, removes all dangers that arise due to bhūtas, and removes the threat of weapons, fire, flooding, and poisoning.

source: རྟག་ཏུ་སྲུང་བ་དང་བསྐྱབ་པ་དང་སྦ་བར་བྱེད་པ། དགྲ་རྣམས་དང་། གཞན་རྒྱལ་བ་ལྡོག་པར་བྱེད་པ། རྒྱལ་པོ་དང་། རྒྱལ་ཕྲན་ནམ།
en: It guards, defends, and protects against enemies at all times, ensures victory over them, and wards them off.

source: བཙུན་མོའི་འཁོར་དུ་སོང་བ་དང་གཙོ་བོ་རྟག་ཏུ་དབང་དུ་བྱེད་ཅིང་ཐམས་ཅད་དུ་ཐོགས་པ་མེད་པར་འགྱུར་རོ།
en: It always brings kings, dowager queens, and the ladies of the harem under the vidyā holder’s thrall—it is the supreme means of enthrallment. “

source: །ཕ་རོལ་གྱི་དམག་ཚོགས་དང་འཁྲུག་པ་དང་། གཡུལ་རྣམས་རྟག་ཏུ་རབ་ཏུ་འཇོམས་པར་བྱེད་པ། གང་གི་ཚེ་ཆོམ་རྐུན་གྱི་ནང་དུ་སོང་བ་ཉིད་དང་།
en: This remedy renders the vidyā holder inviolable in every way and will always destroy the enemy army in the event of a battle or armed conflict.

source: དོན་མཐུན་གྱི་ནང་དང་། རྐུན་མོ་དང་། སེང་གེ་དང་། སྟག་གི་ནང་དུ་སོང་བ་དེའི་ཚེ། ཐམས་ཅད་དུ་སྨན་གྱི་རྒྱལ་བ་སྟེར་རོ།
en: If the vidyā holder or his fellow travelers find themselves in the midst of thieves or bandits, or in the midst of lions or tigers, this remedy will ensure complete victory over them.

source: །ཚེ་རིང་པོར་འགྱུར་ཏེ། རྟག་ཏུ་པདྨའི་ཕྱག་གི་མཆོག་སྦྱིན་པར་འགྱུར་རོ། །ལྷ་རྣམས་ཀྱིས་རྟག་ཏུ་སྲུང་བར་བྱེད་དོ། །གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། ཀླུ་དང་།
en: The vidyā holder will live a long life, will always receive boons from Padmapāṇi, and will always be protected by deities.
